In [1]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [2]:
def create_server_connection(host_name,user_name,user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host= host_name,
            user  =user_name,
            passwd = user_password)
        print("MySql Database connection sucessfull")
    
    except Error as err:
        print(f'Error: '+ str(err))
    
    return connection

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created sucessfully")
    except Error as err:
        print("Error: " + str(err))

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password,
            database = db_name
        )
        print("Mysql database connection sucessfull")
    except Error as e:
        print("Error: " + str(e))    
    return connection

def execute_query(connection, qurey):
    cursor = connection.cursor()
    try:
        cursor.execute(qurey)
        connection.commit()
        print("Query was sucessfull")
    except Error as e:
        print("Error: " + str(e))    

def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as e:
        print("Error: " + str(e))

In [3]:
pw = 'pratham@123'
db = 'mysql_python'
connection = create_server_connection("127.0.0.1",'root',pw)

MySql Database connection sucessfull

In [4]:
create_database_qurey = 'Create database mysql_python'
create_database(connection,create_database_qurey)

Error: 1007 (HY000): Can't create database 'mysql_python'; database exists

In [5]:
create_orders_table = '''
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20)
);
'''
connection = create_db_connection("127.0.0.1",'root', pw, db) 
execute_query(connection, create_orders_table)

Mysql database connection sucessfull
Error: 1050 (42S01): Table 'orders' already exists

In [7]:
data_orders =  """
insert into orders values
(101, 'Steve', 'Laptop', '2018-06-12', 2, 800, '6546542482'),
(102, 'jack', 'top', '2018-06-12', 2, 800, '6546542482'),
(103, 'Seiriya', 'jeans', '2018-06-12', 2, 800, '6546542482'),
(104, 'ganesh', 'chess board', '2018-06-12', 2, 800, '6546542482'),
(105, 'harvi', 'pook', '2018-06-12', 2, 800, '6546542482');
"""
connection = create_db_connection("127.0.0.1","root",pw,db)
execute_query(connection, data_orders)

Mysql database connection sucessfull
Query was sucessful

In [9]:
q1 = """
select * from orders;
"""
connection = create_db_connection("127.0.0.1","root",pw,db)
results = read_query(connection, q1)
for result in results:
    print(result)

Mysql database connection sucessfull
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')
(102, 'jack', 'top', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')
(103, 'Seiriya', 'jeans', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')
(104, 'ganesh', 'chess board', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')
(105, 'harvi', 'pook', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')

In [10]:
q2 = """
select customer_name, phone_number from orders; 
"""
connection = create_db_connection("127.0.0.1","root",pw,db)
results = read_query(connection, q2)
for result in results:
    print(result)

Mysql database connection sucessfull
('Steve', '6546542482')
('jack', '6546542482')
('Seiriya', '6546542482')
('ganesh', '6546542482')
('harvi', '6546542482')

In [12]:
q3 = """
select year(date_ordered) from orders; 
"""
connection = create_db_connection("127.0.0.1","root",pw,db)
results = read_query(connection, q3)
for result in results:
    print(result)

Mysql database connection sucessfull
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)

In [14]:
q4 = """
select distinct year(date_ordered) from orders; 
"""
connection = create_db_connection("127.0.0.1","root",pw,db)
results = read_query(connection, q4)
for result in results:
    print(result)

Mysql database connection sucessfull
(2018,)

In [15]:
q5 = """
select * from orders where date_ordered < '2018-12-31'; 
"""
connection = create_db_connection("127.0.0.1","root",pw,db)
results = read_query(connection, q5)
for result in results:
    print(result)

Mysql database connection sucessfull
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')
(102, 'jack', 'top', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')
(103, 'Seiriya', 'jeans', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')
(104, 'ganesh', 'chess board', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')
(105, 'harvi', 'pook', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')

In [17]:
q7 = """
select * from orders order by unit_price; 
"""
connection = create_db_connection("127.0.0.1","root",pw,db)
results = read_query(connection, q7)
for result in results:
    print(result)

Mysql database connection sucessfull
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')
(102, 'jack', 'top', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')
(103, 'Seiriya', 'jeans', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')
(104, 'ganesh', 'chess board', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')
(105, 'harvi', 'pook', datetime.date(2018, 6, 12), 2, 800.0, '6546542482')

In [20]:
from_db = []
q8 = """
select * from orders;
"""
connection = create_db_connection("127.0.0.1", "root", pw, db)
results = read_query(connection, q8)
for result in results:
    result = list(result)
    from_db.append(result)
colums = ["order_id",'customer_name','product_name',"date_ordered","quantity","unit_price", "phone_number"]

df = pd.DataFrame(from_db,columns= colums)
display(df)

Mysql database connection sucessfull

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Steve,Laptop,2018-06-12,2,800.0,6546542482
1,102,jack,top,2018-06-12,2,800.0,6546542482
2,103,Seiriya,jeans,2018-06-12,2,800.0,6546542482
3,104,ganesh,chess board,2018-06-12,2,800.0,6546542482
4,105,harvi,pook,2018-06-12,2,800.0,6546542482

In [23]:
update = """
update orders
set unit_price = 45
where order_id = 103
"""
connection = create_db_connection("127.0.0.1", 'root', pw,db)
execute_query(connection , update)

Mysql database connection sucessfull
Query was sucessfull

In [26]:
from_db = []
q8 = """
select * from orders;
"""
connection = create_db_connection("127.0.0.1", "root", pw, db)
results = read_query(connection, q8)
for result in results:
    result = list(result)
    from_db.append(result)
colums = ["order_id",'customer_name','product_name',"date_ordered","quantity","unit_price", "phone_number"]

df = pd.DataFrame(from_db,columns= colums)
display(df)

Mysql database connection sucessfull

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Steve,Laptop,2018-06-12,2,800.0,6546542482
1,102,jack,top,2018-06-12,2,800.0,6546542482
2,103,Seiriya,jeans,2018-06-12,2,45.0,6546542482
3,104,ganesh,chess board,2018-06-12,2,800.0,6546542482
4,105,harvi,pook,2018-06-12,2,800.0,6546542482

In [27]:
delete_order = """
delete from orders
where order_id = 102
"""
connection = create_db_connection("127.0.0.1", 'root', pw,db)
execute_query(connection , delete_order)

Mysql database connection sucessfull
Query was sucessfull